## Pandas가 무엇인가요?

In [1]:
import pandas as pd

In [2]:
data_frame = pd.read_csv('data/friend_list.csv')

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [5]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [6]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [7]:
type(data_frame.job)

pandas.core.series.Series

In [8]:
list_tmp = [1, 2, 3]

In [9]:
list_tmp

[1, 2, 3]

In [10]:
s1 = pd.core.series.Series([1, 2, 3])

In [11]:
s2 = pd.core.series.Series(['one', 'two', 'three'])

In [12]:
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three